update documentations and app icon
